ErichStyger/mcuoneclipse/Examples/MCUXpresso/FRDM-KE02Z/FRDM-KE02Z_Blinky/board/pin_mux.h
/*
 * Copyright 2018 NXP.
 * All rights reserved.
 *
 * SPDX-License-Identifier: BSD-3-Clause
 */

/***********************************************************************************************************************
 * This file was generated by the MCUXpresso Config Tools. Any manual edits made to this file
 * will be overwritten if the respective MCUXpresso Config Tools is used to update this file.
 **********************************************************************************************************************/

#ifndef _PIN_MUX_H_
#define _PIN_MUX_H_

/*!
 * @addtogroup pin_mux
 * @{
 */

/***********************************************************************************************************************
 * API
 **********************************************************************************************************************/

#if defined(__cplusplus)
extern "C" {
#endif

/*!
 * @brief Calls initialization functions.
 *
 */
void BOARD_InitBootPins(void);

/*!
 * @brief Configures pin routing and optionally pin electrical features.
 *
 */
void BOARD_InitPins(void);

/*! @name PORTE7 (number 5), D4[3]/LEDRGB_BLUE
  @{ */
#define BOARD_INITLEDSPINS_PTE7_BLUE_GPIO GPIOB            /*!<@brief GPIO device name: GPIOB */
#define BOARD_INITLEDSPINS_PTE7_BLUE_GPIO_PORT kGPIO_PORTE /*!<@brief PORTB GPIO port: PORTB */
#define BOARD_INITLEDSPINS_PTE7_BLUE_PORT PORTE            /*!<@brief PORT device name: PORTE */
#define BOARD_INITLEDSPINS_PTE7_BLUE_PIN 7U                /*!<@brief PORTE pin index: 7 */
                                                           /* @} */

/*! @name PORTH2 (number 6), D4[4]/LEDRGB_GREEN
  @{ */
#define BOARD_INITLEDSPINS_PTH2_GREEN_GPIO GPIOB            /*!<@brief GPIO device name: GPIOB */
#define BOARD_INITLEDSPINS_PTH2_GREEN_GPIO_PORT kGPIO_PORTH /*!<@brief PORTB GPIO port: PORTB */
#define BOARD_INITLEDSPINS_PTH2_GREEN_PORT PORTH            /*!<@brief PORT device name: PORTH */
#define BOARD_INITLEDSPINS_PTH2_GREEN_PIN 2U                /*!<@brief PORTH pin index: 2 */
                                                            /* @} */

/*! @name PORTH1 (number 14), D4[1]/LEDRGB_RED
  @{ */
#define BOARD_INITLEDSPINS_PTH1_RED_GPIO GPIOB            /*!<@brief GPIO device name: GPIOB */
#define BOARD_INITLEDSPINS_PTH1_RED_GPIO_PORT kGPIO_PORTH /*!<@brief PORTB GPIO port: PORTB */
#define BOARD_INITLEDSPINS_PTH1_RED_PORT PORTH            /*!<@brief PORT device name: PORTH */
#define BOARD_INITLEDSPINS_PTH1_RED_PIN 1U                /*!<@brief PORTH pin index: 1 */
                                                          /* @} */

/*!
 * @brief Configures pin routing and optionally pin electrical features.
 *
 */
void BOARD_InitLEDsPins(void);

/*! @name PORTD6 (number 23), J1[7]/PTD6_TSI/PTD6_RXD2
  @{ */
#define BOARD_INITTOUCHPINS_PTD6_TSI_GPIO GPIOA            /*!<@brief GPIO device name: GPIOA */
#define BOARD_INITTOUCHPINS_PTD6_TSI_GPIO_PORT kGPIO_PORTD /*!<@brief PORTA GPIO port: PORTA */
#define BOARD_INITTOUCHPINS_PTD6_TSI_PORT PORTD            /*!<@brief PORT device name: PORTD */
#define BOARD_INITTOUCHPINS_PTD6_TSI_PIN 6U                /*!<@brief PORTD pin index: 6 */
                                                           /* @} */

/*! @name PORTD7 (number 22), J1[5]/PTD7_TSI/PTD7_TXD2
  @{ */
#define BOARD_INITTOUCHPINS_PTD7_TSI_GPIO GPIOA            /*!<@brief GPIO device name: GPIOA */
#define BOARD_INITTOUCHPINS_PTD7_TSI_GPIO_PORT kGPIO_PORTD /*!<@brief PORTA GPIO port: PORTA */
#define BOARD_INITTOUCHPINS_PTD7_TSI_PORT PORTD            /*!<@brief PORT device name: PORTD */
#define BOARD_INITTOUCHPINS_PTD7_TSI_PIN 7U                /*!<@brief PORTD pin index: 7 */
                                                           /* @} */

/*!
 * @brief Configures pin routing and optionally pin electrical features.
 *
 */
void BOARD_InitTOUCHPins(void);

/*! @name PORTC6 (number 52), J1[3]/PTC6_RXD1
  @{ */
#define BOARD_INITDEBUG_UARTPINS_DEBUG_UART_RX_PORT PORTC /*!<@brief PORT device name: PORTC */
#define BOARD_INITDEBUG_UARTPINS_DEBUG_UART_RX_PIN 6U     /*!<@brief PORTC pin index: 6 */
                                                          /* @} */

/*! @name PORTC7 (number 51), J1[1]/PTC7_TXD1
  @{ */
#define BOARD_INITDEBUG_UARTPINS_DEBUG_UART_TX_PORT PORTC /*!<@brief PORT device name: PORTC */
#define BOARD_INITDEBUG_UARTPINS_DEBUG_UART_TX_PIN 7U     /*!<@brief PORTC pin index: 7 */
                                                          /* @} */

/*!
 * @brief Configures pin routing and optionally pin electrical features.
 *
 */
void BOARD_InitDEBUG_UARTPins(void);

/*! @name PORTA3 (number 47), J2[20]/U1[4]/PTA3_ACCEL_SCL/PTA3_D15
  @{ */
#define BOARD_INITACCELPINS_ACCEL_SCL_PORT PORTA /*!<@brief PORT device name: PORTA */
#define BOARD_INITACCELPINS_ACCEL_SCL_PIN 3U     /*!<@brief PORTA pin index: 3 */
                                                 /* @} */

/*! @name PORTA2 (number 48), J2[18]/U1[6]/PTA2_ACCEL_SDA/PTA2_D14
  @{ */
#define BOARD_INITACCELPINS_ACCEL_SDA_PORT PORTA /*!<@brief PORT device name: PORTA */
#define BOARD_INITACCELPINS_ACCEL_SDA_PIN 2U     /*!<@brief PORTA pin index: 2 */
                                                 /* @} */

/*! @name PORTD4 (number 44), U1[11]/PTD4_ACCEL_INT1
  @{ */
#define BOARD_INITACCELPINS_ACCEL_INT1_GPIO GPIOA            /*!<@brief GPIO device name: GPIOA */
#define BOARD_INITACCELPINS_ACCEL_INT1_GPIO_PORT kGPIO_PORTD /*!<@brief PORTA GPIO port: PORTA */
#define BOARD_INITACCELPINS_ACCEL_INT1_PORT PORTD            /*!<@brief PORT device name: PORTD */
#define BOARD_INITACCELPINS_ACCEL_INT1_PIN 4U                /*!<@brief PORTD pin index: 4 */
                                                             /* @} */

/*! @name PORTD3 (number 45), U1[9]/PTD3_ACCEL_INT2
  @{ */
#define BOARD_INITACCELPINS_ACCEL_INT2_GPIO GPIOA            /*!<@brief GPIO device name: GPIOA */
#define BOARD_INITACCELPINS_ACCEL_INT2_GPIO_PORT kGPIO_PORTD /*!<@brief PORTA GPIO port: PORTA */
#define BOARD_INITACCELPINS_ACCEL_INT2_PORT PORTD            /*!<@brief PORT device name: PORTD */
#define BOARD_INITACCELPINS_ACCEL_INT2_PIN 3U                /*!<@brief PORTD pin index: 3 */
                                                             /* @} */

/*!
 * @brief Configures pin routing and optionally pin electrical features.
 *
 */
void BOARD_InitACCELPins(void);

/*! @name PORTB7 (number 11), Y1[2]/EXTAL
  @{ */
#define BOARD_INITOSCPINS_EXTAL_PORT PORTB /*!<@brief PORT device name: PORTB */
#define BOARD_INITOSCPINS_EXTAL_PIN 7U     /*!<@brief PORTB pin index: 7 */
                                           /* @} */

/*! @name PORTB6 (number 12), Y1[1]/XTAL_Y
  @{ */
#define BOARD_INITOSCPINS_XTAL_PORT PORTB /*!<@brief PORT device name: PORTB */
#define BOARD_INITOSCPINS_XTAL_PIN 6U     /*!<@brief PORTB pin index: 6 */
                                          /* @} */

/*!
 * @brief Configures pin routing and optionally pin electrical features.
 *
 */
void BOARD_InitOSCPins(void);

#if defined(__cplusplus)
}
#endif

/*!
 * @}
 */
#endif /* _PIN_MUX_H_ */

/***********************************************************************************************************************
 * EOF
 **********************************************************************************************************************/
